    {
      "id": "web-versions",
      "title": "WEB 1, 2 & 3",
      "content": "Informationen zu verschiedenen Webversionen.",
      "subsections": [],
      "timelineEvents": [
        {
          "date": "1990",
          "description": "Einführung in Web 1.0 – Das statische Internetzeitalter Web 1.0 markiert die Anfänge des Internets, wie wir es kennen, charakterisiert durch statische Webseiten, die primär aus HTML bestehen. In dieser Ära wurden Inhalte überwiegend von Unternehmen erstellt und veröffentlicht. Nutzer fungierten als passive Konsumenten, deren Hauptaktivität das Abrufen und Lesen von Informationen war. Dieses Format bot eine grundlegende Plattform für die ersten digitalen Interaktionen und legte das Fundament für die Weiterentwicklungen des Webs.",
          "subsectionId": "web1"
        },
        {
          "date": "2000",
          "description": "Beginn des Web 2.0 – Das interaktive und soziale Web Web 2.0 leitete eine Ära ein, in der das Internet zunehmend interaktiv und sozial wurde und die Benutzerinteraktion in den Mittelpunkt stellte. Diese Phase kennzeichnete sich durch die Entwicklung von Plattformen, die zur aktiven Teilnahme und Kollaboration der Nutzer anregten. Social Media-Plattformen, Blogs, Wikis und soziale Netzwerke sind herausragende Beispiele für die Innovationen dieser Zeit. Ein wesentliches Merkmal von Web 2.0 ist der weit verbreitete User Generated Content (UGC), bei dem Inhalte von den Nutzern selbst erstellt und geteilt werden, was das Internet dynamischer und vielseitiger machte.",
          "subsectionId": "web2"
        },
        {
          "date": "2010",
          "description": "Aufkommen des Web 3.0 – Das dezentrale Web Mit dem Aufkommen des Web 3.0 erleben wir den Übergang zu einem dezentralen Internet, das wesentlich durch Blockchain-Technologien ermöglicht wird. Diese neue Ära zeichnet sich durch dezentrale Datenhaltung und Governance aus, was einen signifikanten Unterschied zur zentralisierten Struktur von Plattformen im Web 2.0 darstellt. Im Web 3.0 erhalten Inhalte durch digitale Besitznachweise, wie beispielsweise Non-Fungible Tokens (NFTs), eine verifizierte Eigentumsstruktur. Zudem wird Daten ein inhärenter Wert zugeschrieben, der Nutzern größere Kontrolle und Transparenz über ihre eigenen Informationen bietet.",
          "subsectionId": "web3"
        }
      ]
    },